In [ ]:
# Introduction to Machine Learning ---- >

# Data(df) --- > x(input) , y(output)
# x ----- > x_train , x_test
# y ---- > y_train , y_test

# Machine find the relation between input to target data .

# Machine (input) --- > output ????

# Machine(x_train , y_train) ---- > Machine(x_test) ---- > output ?????
# Actual_output = y_test , Machine_predict = y_pred

# Machine Capability ---- > y_test <--- > y_pred

# Step Dividation

In [1]:
import numpy as np 
import pandas as pd

In [2]:
df=pd.read_csv("covid_toy.csv")
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [3]:
df.shape

(100, 6)

In [4]:
df.isnull().sum()

age           0
gender        0
fever        10
cough         0
city          0
has_covid     0
dtype: int64

In [6]:
df['fever']=df['fever'].fillna(df['fever'].mean())

In [7]:
df.isnull().sum()

age          0
gender       0
fever        0
cough        0
city         0
has_covid    0
dtype: int64

In [8]:
x = df.drop(columns = ['has_covid']) ## Input data
# x

In [12]:
y = df['has_covid' ]
## target data

# y

In [14]:
!pip install scikit_learn

Requirement already satisfied: scikit_learn in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (1.7.0)
Requirement already satisfied: numpy>=1.22.0 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from scikit_learn) (2.2.4)
Requirement already satisfied: scipy>=1.8.0 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from scikit_learn) (1.15.3)
Requirement already satisfied: joblib>=1.2.0 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from scikit_learn) (1.5.1)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from scikit_learn) (3.6.0)

In [15]:

from sklearn.model_selection import train_test_split

In [16]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2, random_state=30)

In [19]:
print("Total data shape :" , df.shape)
print("---------------------------")
print("Input data(x) shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)
print("---------------------------")

print("Target data shape(y):", y.shape)
print("y_train data shape :" , y_train.shape)
print("y_test data shape:", y_test.shape)
print("---------------------------")

Total data shape : (100, 6)
---------------------------
Input data(x) shape: (100, 5)
x_train data shape: (80, 5)
x_test data shape: (20, 5)
---------------------------
Target data shape(y): (100,)
y_train data shape : (80,)
y_test data shape: (20,)
---------------------------

In [20]:
# df(100,6) = x(100,5)+ y(100,1)
# x(100,5) = x_train(80,5) + x_test(20,5)
# y(100,1) = y_train(80,1) + y_test(20,1)

In [21]:
df=pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [22]:
df.shape

(418, 12)

In [23]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [25]:
df['Age']=df['Age'].fillna(df['Age'].mean())
# df['Cabin']=df['Cabin'].fillna(df['Cabin'].mean())

In [26]:
df.drop(columns = ['Cabin']) ## Input data
# x

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.50000,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.00000,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.00000,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,30.27259,0,0,A.5. 3236,8.0500,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,PC 17758,108.9000,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,SOTON/O.Q. 3101262,7.2500,S
416,1308,0,3,"Ware, Mr. Frederick",male,30.27259,0,0,359309,8.0500,S
417,1309,0,3,"Peter, Master. Michael J",male,30.27259,1,1,2668,22.3583,C

In [27]:
x = df.drop(columns = ['Survived']) ## Input data
# x

In [28]:
y=df["Survived"]

In [29]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2, random_state=30)

In [30]:
print("Total data shape :" , df.shape)
print("---------------------------")
print("Input data(x) shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)
print("---------------------------")

print("Target data shape(y):", y.shape)
print("y_train data shape :" , y_train.shape)
print("y_test data shape:", y_test.shape)
print("---------------------------")

Total data shape : (418, 12)
---------------------------
Input data(x) shape: (418, 11)
x_train data shape: (334, 11)
x_test data shape: (84, 11)
---------------------------
Target data shape(y): (418,)
y_train data shape : (334,)
y_test data shape: (84,)
---------------------------

In [31]:
df=pd.read_csv("tips.csv")
df.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [32]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [34]:
x = df.drop(columns = ['total_bill']) ## Input data
x

      tip     sex smoker   day    time  size
0    1.01  Female     No   Sun  Dinner     2
1    1.66    Male     No   Sun  Dinner     3
2    3.50    Male     No   Sun  Dinner     3
3    3.31    Male     No   Sun  Dinner     2
4    3.61  Female     No   Sun  Dinner     4
..    ...     ...    ...   ...     ...   ...
239  5.92    Male     No   Sat  Dinner     3
240  2.00  Female    Yes   Sat  Dinner     2
241  2.00    Male    Yes   Sat  Dinner     2
242  1.75    Male     No   Sat  Dinner     2
243  3.00  Female     No  Thur  Dinner     2

[244 rows x 6 columns]

In [35]:
y=df["total_bill"]

In [36]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.3, random_state=40)

In [37]:
print("Total data shape :" , df.shape)
print("---------------------------")
print("Input data(x) shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)
print("---------------------------")

print("Target data shape(y):", y.shape)
print("y_train data shape :" , y_train.shape)
print("y_test data shape:", y_test.shape)
print("---------------------------")

Total data shape : (244, 7)
---------------------------
Input data(x) shape: (244, 6)
x_train data shape: (170, 6)
x_test data shape: (74, 6)
---------------------------
Target data shape(y): (244,)
y_train data shape : (170,)
y_test data shape: (74,)
---------------------------